Revit 2027 API
HVACLoadType.PlenumLighting Property
 The percentage of plenum lighting contribution.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PlenumLighting { get; set; }
Public Property PlenumLighting As Double
	Get
	Set
public:
property double PlenumLighting {
	double get ();
	void set (double value);
}
member PlenumLighting : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The value should be between [0.0,1.0].
See Also
Reference
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace